Catalogs/упСостоянияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСостоянияТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСостоянияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыСостоянийТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыСостоянийТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыСостоянийТС</Name>
			<Comment>Порядок значений связан с порядком элементов в коллекции картинок упКоллекцияТипыСостоянийТС</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРейсе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недоступно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСостоянияТС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение состояний транспортных средств
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Элемент = Справочники.упСостоянияТС.Свободно.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Свободно;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.ВРейсе.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.ВРейсе;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.Ремонт.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Ремонт;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.Недоступно.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Недоступно;
	Элемент.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПервоначальноеЗаполнение()

#КонецОбласти

#КонецЕсли
